noarkexchange/src/test/resources/p360/PutMessageAppReceipt.xml

<s:Envelope encoding="utf-8" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <PutMessageRequest xmlns="http://www.arkivverket.no/Noark/Exchange/types">
            <envelope contentNamespace="http://www.arkivverket.no/Noark4-1-WS-WD/types" xmlns="">
                <sender>
                    <orgnr>968041819</orgnr>
                </sender>
                <receiver>
                    <orgnr>991825827</orgnr>
                </receiver>
            </envelope>
            <payload xsi:type="xsd:string" xmlns="">&lt;AppReceipt type="OK"
                xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                xmlns="http://www.arkivverket.no/Noark/Exchange/types"&gt;
                &lt;message code="Recno" xmlns=""&gt;
                &lt;text&gt;315635&lt;/text&gt;
                &lt;/message&gt;
                &lt;/AppReceipt&gt;</payload>
        </PutMessageRequest>
    </s:Body>
</s:Envelope>