noarkexchange/src/test/resources/ephorte/PutMessageMessage.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
>
    <soap:Body>
        <PutMessageRequest xmlns="http://www.arkivverket.no/Noark/Exchange/types">
            <envelope conversationId="bb8323b9-1023-4046-b620-63c4f9120b62"
                      contentNamespace="http://www.arkivverket.no/Noark4-1-WS-WD/types" xmlns="">
                <sender>
                    <orgnr></orgnr>
                    <name>Sender name</name>
                    <email>senderemail@difi.no</email>
                    <ref>2016/1</ref>
                </sender>
                <receiver>
                    <orgnr>910075918</orgnr>
                    <name>Recipient name</name>
                    <email>recipientemail@difi.no</email>
                    <ref/>
                </receiver>
            </envelope>
            <payload xmlns="">&lt;?xml version="1.0" encoding="utf-8"?&gt;&lt;Melding
                xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                xmlns="http://www.arkivverket.no/Noark4-1-WS-WD/types"&gt;&lt;journpost xmlns=""&gt;&lt;jpId&gt;123&lt;/jpId&gt;&lt;jpJaar&gt;2016&lt;/jpJaar&gt;&lt;jpSeknr&gt;123&lt;/jpSeknr&gt;&lt;jpJpostnr&gt;123&lt;/jpJpostnr&gt;&lt;jpJdato&gt;2016-03-21&lt;/jpJdato&gt;&lt;jpNdoktype&gt;U&lt;/jpNdoktype&gt;&lt;jpDokdato&gt;2016-03-21&lt;/jpDokdato&gt;&lt;jpStatus&gt;F&lt;/jpStatus&gt;&lt;jpInnhold&gt;Test
                - liten fil - 22.04.16&lt;/jpInnhold&gt;&lt;jpU1&gt;0&lt;/jpU1&gt;&lt;jpForfdato /&gt;&lt;jpTgkode /&gt;&lt;jpUoff
                /&gt;&lt;jpAgdato /&gt;&lt;jpAgkode /&gt;&lt;jpSaksdel /&gt;&lt;jpU2&gt;0&lt;/jpU2&gt;&lt;jpArkdel /&gt;&lt;jpTlkode
                /&gt;&lt;jpAntved&gt;0&lt;/jpAntved&gt;&lt;jpSaar&gt;2016&lt;/jpSaar&gt;&lt;jpSaseknr&gt;1&lt;/jpSaseknr&gt;&lt;jpOffinnhold&gt;Test
                - liten fil - 22.04.16&lt;/jpOffinnhold&gt;&lt;jpTggruppnavn /&gt;&lt;avsmot&gt;&lt;amId&gt;92&lt;/amId&gt;&lt;amOrgnr&gt;986187243&lt;/amOrgnr&gt;&lt;amIhtype&gt;1&lt;/amIhtype&gt;&lt;amKopimot&gt;0&lt;/amKopimot&gt;&lt;amBehansv&gt;0&lt;/amBehansv&gt;&lt;amNavn&gt;Difi&lt;/amNavn&gt;&lt;amU1&gt;0&lt;/amU1&gt;&lt;amKortnavn&gt;Difi&lt;/amKortnavn&gt;&lt;amAdresse&gt;Pb
                253&lt;/amAdresse&gt;&lt;amPostnr&gt;0118&lt;/amPostnr&gt;&lt;amPoststed&gt;OSLO&lt;/amPoststed&gt;&lt;amUtland
                /&gt;&lt;amEpostadr&gt;someone@difi.no&lt;/amEpostadr&gt;&lt;amRef /&gt;&lt;amJenhet /&gt;&lt;amAvskm
                /&gt;&lt;amAvskdato /&gt;&lt;amFrist /&gt;&lt;amForsend&gt;D&lt;/amForsend&gt;&lt;amAdmkort&gt;[Ufordelt]&lt;/amAdmkort&gt;&lt;amAdmbet&gt;Ufordelt/sendt
                tilbake til arkiv&lt;/amAdmbet&gt;&lt;amSbhinit&gt;[Ufordelt]&lt;/amSbhinit&gt;&lt;amSbhnavn&gt;Ikke
                fordelt til saksbehandler&lt;/amSbhnavn&gt;&lt;amAvsavdok /&gt;&lt;amBesvardok /&gt;&lt;/avsmot&gt;&lt;dokument&gt;&lt;dlRnr&gt;1&lt;/dlRnr&gt;&lt;dlType&gt;H&lt;/dlType&gt;&lt;dbKategori&gt;ND&lt;/dbKategori&gt;&lt;dbTittel&gt;Test
                - liten fil - 22.04.16&lt;/dbTittel&gt;&lt;dbStatus&gt;F&lt;/dbStatus&gt;&lt;veVariant&gt;A&lt;/veVariant&gt;&lt;veDokformat&gt;RA-PDF&lt;/veDokformat&gt;&lt;fil&gt;&lt;base64&gt;&lt;/base64&gt;&lt;/fil&gt;&lt;veFilnavn&gt;123.PDF&lt;/veFilnavn&gt;&lt;veMimeType&gt;application/pdf&lt;/veMimeType&gt;&lt;/dokument&gt;&lt;/journpost&gt;&lt;noarksak
                xmlns=""&gt;&lt;saId&gt;6&lt;/saId&gt;&lt;saSaar&gt;2016&lt;/saSaar&gt;&lt;saSeknr&gt;1&lt;/saSeknr&gt;&lt;saPapir&gt;0&lt;/saPapir&gt;&lt;saDato&gt;2016-01-25&lt;/saDato&gt;&lt;saTittel&gt;Test
                - Difi&lt;/saTittel&gt;&lt;saU1&gt;0&lt;/saU1&gt;&lt;saStatus&gt;B&lt;/saStatus&gt;&lt;saArkdel&gt;SAK1&lt;/saArkdel&gt;&lt;saType
                /&gt;&lt;saJenhet&gt;DIFI&lt;/saJenhet&gt;&lt;saTgkode /&gt;&lt;saUoff /&gt;&lt;saBevtid /&gt;&lt;saKasskode
                /&gt;&lt;saKassdato /&gt;&lt;saProsjekt /&gt;&lt;saOfftittel&gt;Test - Difi&lt;/saOfftittel&gt;&lt;saAdmkort&gt;TEST&lt;/saAdmkort&gt;&lt;saAdmbet&gt;Administrasjon&lt;/saAdmbet&gt;&lt;saAnsvinit&gt;BLA&lt;/saAnsvinit&gt;&lt;saAnsvnavn&gt;Ola
                Normann&lt;/saAnsvnavn&gt;&lt;saTggruppnavn /&gt;&lt;/noarksak&gt;&lt;/Melding&gt;</payload>
        </PutMessageRequest>
    </soap:Body>
</soap:Envelope>