noarkexchange/src/test/resources/ephorte/PutMessageAppReceipt.xml

<s:Envelope encoding="utf-8" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <PutMessageRequest xmlns="http://www.arkivverket.no/Noark/Exchange/types">
            <envelope contentNamespace="http://www.arkivverket.no/Noark4-1-WS-WD/types" conversationId="DetteErEnTest" xmlns="">
                <sender>
                    <orgnr>991825827</orgnr>
                </sender>
                <receiver>
                    <orgnr>991825827</orgnr>
                </receiver>
            </envelope>
            <payload xsi:type="xsd:string" xmlns=""><![CDATA[<AppReceipt type="OK" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                xmlns="http://www.arkivverket.no/Noark/Exchange/types"><message code="Recno" xmlns=""><text>272734</text></message></AppReceipt>]]></payload>
        </PutMessageRequest>
    </s:Body>
</s:Envelope>